content/notes/20201205135826-three_principal_layers.md
+++
title = "Three Principal Layers"
author = ["Wayanjimmy"]
publishDate = 2020-12-05
draft = false
+++

related
: [Pattern of Enterprice Application Architecture]({{< relref "20201205141225-pattern_of_enterprice_application_architecture" >}})


## Presentation Layer {#presentation-layer}

Provision of services, display of information (e.g. in windows or HTML, handling of user request, mouse clicks, keyboard hints), HTTP requests, command line invocation, batch API


## Domain Layer {#domain-layer}

Logic that is the real point of the system


## Data Source Layer {#data-source-layer}

Communication with databases, messaging systems, transaction managers, other packages...
